---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.MEPCalculationFailures.NetworkInconsistentDemandFlow
source: html/5f29e212-710a-7430-9330-39e3d522b210.htm
---
# Autodesk.Revit.DB.BuiltInFailures.MEPCalculationFailures.NetworkInconsistentDemandFlow Property

The specified flow on this equipment is inconsistent with the other equipment in this branch. The branch flow is calculated based on the maximum specified value.

## Syntax (C#)
```csharp
public static FailureDefinitionId NetworkInconsistentDemandFlow { get; }
```